app/Controllers/ProductCategories.php

    public function delete($id = null)
    {
        $model = new ProductCategoryModel();
        $data = $model->find($id);
        if($data){
            $model->delete($id);
---
SELECT *
FROM `product_categories`
WHERE `product_categories`.`id` = '7'
DELETE FROM `product_categories`
WHERE `id` IN ('7')