app/Models/ProductCategoryModel.php

SELECT `product_categories`.*
FROM `product_categories`
---
    public function all(){
        return $this->select('product_categories.*')
            ->get()
            ->getResult();

SELECT *
FROM `product_categories`
WHERE `id` = '7'
---
    public function getOne($id){
        return $this->getWhere([
            'id' => $id
        ])->getResult();