app/Models/UserStatusesModel.php

    public function all(){
        return $this->select('user_statuses.*')
            ->get()
            ->getResult();
---
SELECT `user_statuses`.*
FROM `user_statuses`

    public function getOne($id){
        return $this->getWhere([
            'id' => $id
        ])->getResult();
---
SELECT *
FROM `user_statuses`
WHERE `id` = '1'